{
  "basics": {
    "name": "Benyamin Jami",
    "label": "NLP Research Associate at Huawei",
    "image": "",
    "email": "benyamin.jami76@gmail.com",
    "phone": "226-899-0692",
    "url": "https://benyaminjami.github.io/",
    "summary": "4+ years of experience in Machine Learning, AI Research, and Model Optimization. Expertise in Generative Models, Transformer Models, Speculative Decoding, Hybrid Models with Mamba, and Knowledge Distillation.",
    "location": {
      "address": "",
      "postalCode": "",
      "city": "Toronto",
      "countryCode": "CA",
      "region": "Ontario"
    },
    "profiles": [
      {
        "network": "LinkedIn",
        "username": "Benyamin Jami",
        "url": "https://www.linkedin.com/in/ben-jami/"
      }
    ]
  },
  "work": [
    {
      "name": "Huawei Technologies Canada",
      "position": "Research Associate",
      "url": "https://www.huawei.com/ca/",
      "startDate": "2024-05-01",
      "endDate": "",
      "summary": "Led research initiatives to enhance transformer model efficiency for training and inference.",
      "highlights": [
        "Implemented and trained speculative techniques like Eagle and Medusa on Huawei's Pangu (40B parameter language model).",
        "Pretrained and fine-tuned large-scale language models (1B - 40B parameters) in multi-node environments.",
        "Transformed a fully transformer-based model into a 50% Mamba-layer hybrid model using knowledge distillation.",
        "Mentored and guided two interns."
      ]
    },
    {
      "name": "University of Waterloo",
      "position": "Research Assistant",
      "url": "",
      "startDate": "2021-09-01",
      "endDate": "2023-12-01",
      "summary": "Implemented a transformer-based model to translate antigens into antibody sequences.",
      "highlights": [
        "Implemented a transformer-based model to translate antigens into antibody sequences, leveraging a semi-supervised framework and back translation for training on 2M unsupervised samples.",
        "Enhanced model performance by 30, outperforming state-of-the-art sequential methods in antibody sequence prediction.",
        "Integrated a graph neural network with a protein language model, employing a non-autoregressive training approach, achieved a 60 improvement in antibody affinity optimization.",
        "Achieved a 7 improvement over state-of-the-art models in antibody sequence recovery, demonstrating the efficacy of the integrated model."
      ]
    },
    {
      "name": "General Motors Canada",
      "position": "Data Scientist (Co-op)",
      "url": "https://www.gm.ca/en/home.html",
      "startDate": "2022-09-01",
      "endDate": "2023-04-01",
      "summary": "Designed and implemented a dashboard solution for the Warranty Support Center.",
      "highlights": [
        "Designed and implemented a cutting-edge dashboard solution for the Warranty Support Center (WSC), integrating data from disparate sources, optimizing reporting processes, and delivering a 15% reduction in manual errors and a 20% faster claims processing time.",
        "Coordinated with teams across Canada and the U.S. to align strategic objectives, streamline processes, and achieve a 50% reduction in project delays.",
        "Leveraged Greenplum, Oracle, and Hue databases for data collection, organization, and analysis."
      ]
    },
    {
      "name": "Digikala",
      "position": "Machine Learning Engineer",
      "url": "https://www.digikala.com/",
      "startDate": "2020-07-01",
      "endDate": "2021-08-01",
      "summary": "Developed features for the search/recommendation engine to boost search queries.",
      "highlights": [
        "Developed different features for the search engine such as related search using likelihood optimization, boosting search queries per session by 8%.",
        "Enhanced search ranking by developing a Named Entity Recognition module for the Learning to Rank model, using the Hidden Markov Model, increasing conversion rate by 7%.",
        "Leveraged PySpark to process and analyze data for 10M users, enabling the creation of a robust Item Factorization algorithm that revolutionized main page carousel recommendations for personalized user experiences."
      ]
    }
  ],
  "education": [
    {
      "institution": "University of Waterloo",
      "location": "Waterloo, Canada",
      "url": "",
      "area": "Computer Science",
      "studyType": "M.Math.",
      "startDate": "2021-09-01",
      "endDate": "2023-12-01",
      "score": "",
      "Thesis": ["Advancing Antibody Design: Integrating Protein Language Models for Enhanced Computational Strategies"]
    },
    {
      "institution": "Sharif University of Technology",
      "location": "Tehran, Iran",
      "url": "",
      "area": "Computer Engineering",
      "studyType": "B.Sc.",
      "startDate": "2017-09-01",
      "endDate": "2021-12-01",
      "score": "",
      "Thesis": ["Deep learning approach with Variational Autoencoder architecture in image transfer over noisy channels"]
    }
  ],
  "publications": [
    {
      "name": "Balcony: A Lightweight Approach to Dynamic Inference of Generative Language Models",
      "publisher": "arXiv",
      "releaseDate": "2025",
      "url": "",
      "summary": "Research on dynamic inference for generative language models."
    },
    {
      "name": "Echoatt: Attend, copy, then adjust for more efficient large language models",
      "publisher": "arXiv",
      "releaseDate": "2024",
      "url": "",
      "summary": "Research on improving efficiency of large language models."
    },
    {
      "name": "Advancing Antibody Design: Integrating Protein Language Models for Enhanced Computational Strategies",
      "publisher": "University of Waterloo",
      "releaseDate": "2024",
      "url": "",
      "summary": "Master's thesis on integrating protein language models for antibody design."
    },
    {
      "name": "Conditional Sequence-Structure Integration: A Novel Approach for Precision Antibody Engineering and Affinity Optimization",
      "publisher": "bioRxiv",
      "releaseDate": "2024",
      "url": "",
      "summary": "Research on precision antibody engineering using sequence-structure integration."
    },
    {
      "name": "Split-transformer Impute (STI): genotype imputation using a transformer-based model",
      "publisher": "bioRxiv",
      "releaseDate": "2023",
      "url": "",
      "summary": "Research on genotype imputation using transformer-based models."
    },
    {
      "name": "A variational auto-encoder approach for image transmission in wireless channel",
      "publisher": "arXiv",
      "releaseDate": "2020",
      "url": "https://arxiv.org/abs/2010.03967",
      "summary": "Research on using variational auto-encoders for image transmission in wireless channels."
    }
  ]
}
